{
    "version": "https://jsonfeed.org/version/1",
    "title": "Krim Labs Blog Feed",
    "home_page_url": "https://krimlabs.com",
    "description": "Articles about Clojure, Blockchain, Ethereum, Privacy, UX and SaaS",
    "items": [
        {
            "id": "https://krimlabs.com/blog/clay-bricks-vs-legos",
            "content_html": "<p><em>Lego blocks and clay bricks image courtesy of <a href=\"www.freepik.com\">Freepik</a></em></p>\n<h1 id=\"the-rigidity-of-non-fungible-tokens\">The rigidity of non fungible tokens</h1>\n<p>The year 2021 saw the first bull run of digital collectibles. Digital ownership is a revolutionary concept, but we believe that we are not using it to its potential. Profile pictures are cool for sure, but what if you want to change the color of your ape&#39;s t-shirt?</p>\n<p>Current non-fungible tokens are also non-malleable. They are like clay brick structures. Once minted, they cannot be changed easily and predictably. This restricts their usage is perfect use-cases like games and metaverse identity. Imagine a game like Fortnite where your character evolves over time. If new weapons and skins were to be NFTs, you could truly own them and trade them on secondary marketplaces. But this is not the case. And one of the reason for that is NFTs don&#39;t evolve.</p>\n<p>This is similar to what happened when web2 came into being, and publishers started publishing magazines on the internet. Only later we realised that online apps could be an interactive two-way stream.</p>\n<h1 id=\"attribute-based-upgrades\">Attribute based upgrades</h1>\n<p>Attribute based upgrades are clumsy and unpredictably. Like clay brick structures can be modified to some extent, but the original structure gets compromised.</p>\n<p>There are smart contracts that can be used to update the metadata or attributes of an NFT. One good example is <a href=\"https://www.genopets.me/\">Genopets</a> where your pet evolves over time by modifying attributes. </p>\n<h2 id=\"serum-airdrop\">Serum airdrop</h2>\n<p>Another example of an upgrade is Bored Ape Serum NFTs. This serum could be burnt to get a new ape NFT but now you have two rigid NFTs. An upgrade for sure, but not quite.</p>\n<h1 id=\"attribute-upgrades-burn-or-modify-underlying-token\">Attribute upgrades burn or modify underlying token</h1>\n<p>Attribute upgrade is a problem because each time you upgrade, your original NFT is lost. This is also restricted because all possible upgrades need to be defined at mint-time. This leads to a close-world game experience. This also means that once upgraded, you cannot go back to the original version.</p>\n<h2 id=\"loss-of-predictable-value\">Loss of predictable value</h2>\n<p>Another problem is determining the value of upgraded NFT. If you upgraded your NFT that was valued at 8 ETH with an attribute that is not popular, will the 8 ETH value appreciate or depreciate? After you have upgraded your NFT multiple times, it becomes practically impossible to determine the value of your NFT.</p>\n<h1 id=\"meta-blocks-upgrade-standard\">Meta Blocks upgrade standard</h1>\n<p>NFTs are the perfect complement to metaverse and games. In fact, they are our chance to own the metaverse! But the current level of abstraction is low.</p>\n<p>The Meta Blocks upgrade standard is an open-source smart contract that can be used to upgrade NFTs without modifying or burning them. </p>\n<p>If NFTs are clay brick structures, then Meta Blocks are legos that compose.</p>\n<p><a href=\"https://twitter.com/brianjcho/status/1460648264919699459\">https://twitter.com/brianjcho/status/1460648264919699459</a></p>\n<p>This works by leveraging an escrow contract. All NFTs are sent to this escrow contract and the contract in turn returns a JSON object which lists all the NFTs held by a user. This JSON object is on-chain and can be read by applications in a permissionless way.</p>\n<p>There are four main components in this standard: universes, base layers, augmentation and retraction.</p>\n<h2 id=\"universes\">Universes</h2>\n<p>Think of a universe as a game or a metaverse, where you NFT character exists and can be upgraded. On paper, a universe is a wallet address registered on chain.</p>\n<p><img src=\"/img/content/posts/screenshot-2021-11-23-at-9.04.26-am.png?medium\" alt=\"Meta Blocks universes stored on-chain\"></p>\n<p>If you are building a Fortnite like game on-chain, then:</p>\n<ul>\n<li>your company&#39;s multisig wallet is the universe address</li>\n<li>avatars, weapons, in-game rewards and the skins are NFTs</li>\n<li>NFTs can be combined by any player inside your universe</li>\n<li>the combined NFT structure exists publicly on-chain</li>\n</ul>\n<p>The concept of a universe enables different projects to use the same contract. This fosters innovation and serves as a tool for public good.</p>\n<h2 id=\"base-layers\">Base layers</h2>\n<p>Base layer is the starting point or the base of your NFT upgrades. Meta Blocks combines NFT data in the escrow. But for an actual upgrade to happen, the visual representation needs to change too. If you buy a new weapon NFT for your game character, the game developer needs to build the render of your character and the weapon in order for you to see it on-screen.</p>\n<p><img src=\"/img/content/posts/screenshot-2021-11-23-at-9.04.09-am.png?medium\" alt=\"Base layers in Meta Blocks contract\"></p>\n<p>The base layer is the model (3d/2d/whatever) to which upgrades will be applied to. It is optional and can be empty in cases where there is no base and everything is swappable. </p>\n<p>You (as a wallet address) buy a base layer, and store in in the Meta Blocks escrow against a universe.</p>\n<h2 id=\"augmentation\">Augmentation</h2>\n<p>Once you have a base layer, it&#39;s time for you to upgrade. In the Meta Blocks universe, upgrades happen when you buy limited edition drops. The drops augment your avatar with the item you bought. For example, if you bought blue jeans and a yellow top, your avatar will be rendered wearing them.</p>\n<p><img src=\"/img/content/posts/screenshot-2021-11-23-at-9.13.58-am.png?medium\" alt=\"Meta Blocks NFT augmentation\"></p>\n<p>Augmentation locks the upgrade (NFT for skin, weapon etc) in the contract and updates the state of your base in a specific universe.</p>\n<h2 id=\"retraction\">Retraction</h2>\n<p>If augmentation is buying new stuff, then retraction is selling what you already own. This is done by removing the NFT from escrow, and updating the JSON state of the universe.</p>\n<p><img src=\"/img/content/posts/screenshot-2021-11-23-at-5.43.00-pm.png?medium\" alt=\"Meta Blocks Protocol Retraction flow\"></p>\n<p>Once the NFT is out of the escrow, it shows up as a normal token in your wallet.\nIn future, we might also have a combined representation of all NFTs stored on the escrow.</p>\n<h2 id=\"no-special-marketplace\">No special marketplace</h2>\n<p>NFTs once out of the escrow contract can be bought and sold on any NFT marketplace. </p>\n<h1 id=\"why-augment-on-chain\">Why augment on-chain?</h1>\n<p>If  your character and all upgrades were in the form of NFTs in your wallet, why do we need a contract on-chain?</p>\n<p>Why can&#39;t the game read your wallet and check all the upgrades you own and render them?</p>\n<h2 id=\"on-chain-verifiability\">On-chain verifiability</h2>\n<p>If individual applications decide NFTs that are valid in their universe, the possibility of public verification is lost. </p>\n<p>What if the game stops supporting a skin that you paid 1.3 ETH for. How would you prove the legitimacy of your artifact? If the augmentation happens on-chain, the verification stays permissionless.</p>\n<h2 id=\"re-inventing-the-wheel\">Re-inventing the wheel</h2>\n<p>Every website on the internet can write their own standard for transmitting data, but instead, they rely on HTTP. This allows them to focus on building the site and not worrying that packets will be lost in transit.</p>\n<p>Having a standard fosters the pace of innovation, because tooling composes and compounds overtime. </p>\n<h1 id=\"use-cases-of-meta-blocks\">Use cases of Meta Blocks</h1>\n<p>Having an upgradeable NFT standard enables use-cases across games and metaverses. </p>\n<h2 id=\"avatars\">Avatars</h2>\n<p>The Meta Blocks platform is building an avatar system similar to <a href=\"https://www.bitmoji.com/\">Bitmoji</a>. This avatar can be carried across metaverses and games with our SDKs.</p>\n<p><img src=\"/img/content/posts/mb-use-cases.jpg?large\" alt=\"Meta Blocks avatars and live streaming\"></p>\n<h3 id=\"stickers\">Stickers</h3>\n<p>Using the NFT avatars we can render stickers similar to <a href=\"https://www.bitmoji.com/\">Bitmoji</a>. These stickers will work in the web2 universe and have the potential to attract the web2 audience to web3. Unlike web2 stickers, the Meta Blocks stickers are real, tradable assets.</p>\n<h3 id=\"live-avatars\">Live avatars</h3>\n<p>This avatar will eventually be used for streaming and podcasting. The real world will be the metaverse.</p>\n<h2 id=\"sol-army-and-other-game-projects\">Sol Army and other game projects</h2>\n<p><em>Note: Meta Blocks is not affiliated to Sol Army in any way. This is only an opinion.</em></p>\n<p><a href=\"https://www.solarmy.io/\">Sol Army</a> is a collection of soldier NFTs with upgradeable attributes like weapons, clothing, strength etc. </p>\n<p>A project like Sol Army can use the Meta Blocks upgrade standard to update their soldiers. In this case, since all parts are swappable, they can start with an empty base layer and drop other attributes as NFTs. As the user buys this drop, their soldiers will start evolving.</p>\n<h2 id=\"degen-apes-and-other-pfp-projects\">Degen Apes and other PFP projects</h2>\n<p><em>Note: Meta Blocks is not affiliated to Degen Ape Academy in any way. This is only an opinion.</em></p>\n<p>NFT collections with existing communities can partner with Meta Blocks, and bring their NFTs as drops in the Meta Blocks avatar universe. This will allow a user of an ape (or punk or penguin) to wear their ape as a mask or a jump suit in the Meta Blocks universe. And enable them to express themselves in the web2 space in the form of stickers.</p>\n<h2 id=\"conclusion\">Conclusion</h2>\n<p>Meta Blocks is the missing piece in making NFTs sustainable. The Meta Blocks protocol abstracts the combination of NFTs and exposes it as a simple open-source contract.</p>\n<p>It does so while maintaining all the properties of traditional NFTs and using all platforms that exist to support them. </p>\n<p>If you are a game or NFT project and want to use Meta Blocks you backend, please contact us. We are happy to chat!</p>\n<p>If you are a user of Bitmoji and are excited by the possibility of NFT avatars, join our waitlist. Can&#39;t control the excitement? Say &quot;hi!&quot; on discord and be a part of our community.</p>\n",
            "url": "https://krimlabs.com/blog/clay-bricks-vs-legos",
            "title": "Clay bricks versus Legos",
            "summary": "NFTs are rigid because there is no standard for upgrading them",
            "image": "https://krimlabs.com/img/content/posts/legos-vs-clay-bricks-hero.jpg",
            "date_modified": "2021-11-23T01:25:09.531Z",
            "author": {
                "name": "Shivek Khurana 🍀",
                "url": "https://krimlabs.com/authors/shivekkhurana"
            }
        },
        {
            "id": "https://krimlabs.com/blog/lets-start-with-blocks",
            "content_html": "<p>NFTs took over the world by storm earlier this year. The booming bull market was the perfect incubator to test out the concept of digital ownership. </p>\n<p>However, there’s a huge problem with the existing NFT model. As bizarre as each ape is, as quirky as every punk is or as zany as every other NFT project is, most of them have no utility post minting. </p>\n<p>Once there’s a liquidity crunch, the NFT space will witness one of the biggest rug pulls caused by market forces. Leaving aside a handful of the top projects, the rest of the NFT investors will be left ‘in it for the art.’ </p>\n<p>The growing interest and development of Metaverse has paved a path for NFTs to grow beyond “collectibles” and turn into one’s digital identity. Facebook and Microsoft’s debut Metaverses have attracted the non-crypto community to the vision of Metaverse. </p>\n<p>However, as soon as the web2 wetaverses make a debut, people will realise the <a href=\"https://www.vice.com/en/article/88g9vv/zuckerbergs-meta-endgame-is-monetizing-all-human-behavior\">privacy issues</a> that come with the vision of tracking all human data. Web3 projects have been historically mimicking web2 ideas on chain, but with the vision of metaverse, web3 has the chance to go head-to-head with web2. </p>\n<p>Unfortunately, the current NFT structure does not support this. That’s where Meta Blocks comes in the picture. </p>\n<p>NFTs are rigid. </p>\n<p>Meta Blocks makes NFTs upgradeable. </p>\n<p><a href=\"https://twitter.com/metabigbrain/status/1458048065902891013\">https://twitter.com/metabigbrain/status/1458048065902891013</a></p>\n<p>The current web3 NFT structure lacks upgradability, which means if you mint an NFT you’re either stuck with it or, if it has the capacity to change its metadata, then the original NFT is lost, as is the case with GenoPets. In such a case, there is no customization. Find out more about the two ways an NFT can be upgraded. </p>\n<p>Customizable NFTs will act as the basis of all the multiverses in a metaverse and be your virtual identity. </p>\n<p><a href=\"https://twitter.com/metabigbrain/status/1458080468235063302\">https://twitter.com/metabigbrain/status/1458080468235063302</a></p>\n<p>There’s a huge market of youngsters who grew up using Bitmoji (an app with over 100 mil downloads on Android). For them, their virtual identity is far more important than their real identity. For them, Facebook’s Metaverse will be a dream come true where they can do much more with their virtual identities. However, soon they’ll realise that they don’t “own” their identity and they’re being tracked at every moment. </p>\n<p>At that moment, the crypto world will welcome 100 million new users via the path of Meta Blocks. We’re here to build that future. </p>\n",
            "url": "https://krimlabs.com/blog/lets-start-with-blocks",
            "title": "How to build a Metaverse? Let’s start with the blocks ",
            "summary": "Introducing Meta Blocks: The NFT Evolution Protocol ",
            "image": "https://krimlabs.com/img/content/posts/lets-start-with-blocks.jpg",
            "date_modified": "2021-11-10T15:36:37.222Z",
            "author": {
                "name": "Sarthak Khurana 🔮",
                "url": "https://krimlabs.com/authors/sarthakkhurana"
            }
        }
    ]
}